// Напишите программу, которая считает произведение двух переданных ей чисел.
// Оператор умножения выглядит так: *

int a = int.Parse(Console.ReadLine());
int b = int.Parse(Console.ReadLine());

int mult = a * b;

Console.WriteLine(mult);